---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.Clear
source: html/e5ce394e-4c64-f376-3141-372dc3f3c04f.htm
---
# Autodesk.Revit.DB.ElementSet.Clear Method

Removes every item element the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```